# Pandas (seconda parte)

In questo notebook andremo ad utilizzare Scikit-learn (libreria di Machine Learning http://scikit-learn.org), solo per scaricare il dataset che importeremo come Pandas dataframe.

Andiamo a vedere altri operazioni utili su Pandas dataframe.

In [1]:
from sklearn.datasets import load_iris
import pandas as pd

In [2]:
data = load_iris()

In [3]:
type(data)

sklearn.utils.Bunch

In [4]:
iris = pd.DataFrame(data.data, columns=data.feature_names)
iris.head(3)

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2

In [5]:
iris.tail(3)

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

In [6]:
iris.shape

(150, 4)

In [7]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
sepal length (cm)    150 non-null float64
sepal width (cm)     150 non-null float64
petal length (cm)    150 non-null float64
petal width (cm)     150 non-null float64
dtypes: float64(4)
memory usage: 4.8 KB

In [8]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.054000,3.758667,1.198667
std,0.828066,0.433594,1.764420,0.763161
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

## Reducing functions 

Possiamo usare funzioni statistiche direttamente sul nostro dataframe:  
* mean()
* std()
* sum()
* first(), last()
* max(), min())

In [9]:
iris.mean()

sepal length (cm)    5.843333
sepal width (cm)     3.054000
petal length (cm)    3.758667
petal width (cm)     1.198667
dtype: float64

In [10]:
iris.std()

sepal length (cm)    0.828066
sepal width (cm)     0.433594
petal length (cm)    1.764420
petal width (cm)     0.763161
dtype: float64

In [11]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

### Cambiare nomi a colonne

In [12]:
# La lista deve contenere l'esatto numero di colonne
iris.columns = ['sepal_l', 'sepal_wid', 'petal_len', 'petal_wid']

In [13]:
iris.head()

   sepal_l  sepal_wid  petal_len  petal_wid
0      5.1        3.5        1.4        0.2
1      4.9        3.0        1.4        0.2
2      4.7        3.2        1.3        0.2
3      4.6        3.1        1.5        0.2
4      5.0        3.6        1.4        0.2

#### Cambio nome ad una sola colonna
Associo ad un nuovo dataframe perché il cambiamento sia permanente

In [14]:
iris = iris.rename(columns = {'sepal_l':'sepal_len'})

In [15]:
iris.head()

   sepal_len  sepal_wid  petal_len  petal_wid
0        5.1        3.5        1.4        0.2
1        4.9        3.0        1.4        0.2
2        4.7        3.2        1.3        0.2
3        4.6        3.1        1.5        0.2
4        5.0        3.6        1.4        0.2

## Usare più condizioni con `.loc` (on `.iloc`)

Possiamo usare **&** (and) se entrambe le condizioni (poste fra parentesi) devono essere vere,  
oppure possiamo usare **|** (or) se basta che una delle condizioni debba essere vera.

In [16]:
iris.loc[(iris['sepal_len'] >= 5) & (iris['sepal_wid'] >= 3.2)].head(4)

   sepal_len  sepal_wid  petal_len  petal_wid
0        5.1        3.5        1.4        0.2
4        5.0        3.6        1.4        0.2
5        5.4        3.9        1.7        0.4
7        5.0        3.4        1.5        0.2

In [17]:
new_iris = iris.loc[(iris['sepal_len'] >= 5) & (iris['sepal_wid'] >= 3.2)]

In [18]:
new_iris.head()

    sepal_len  sepal_wid  petal_len  petal_wid
0         5.1        3.5        1.4        0.2
4         5.0        3.6        1.4        0.2
5         5.4        3.9        1.7        0.4
7         5.0        3.4        1.5        0.2
10        5.4        3.7        1.5        0.2

In [19]:
new_iris.shape

(47, 4)

## Cancellare colonne o righe

In [20]:
iris2 = iris.drop(['sepal_len', 'sepal_wid'], axis=1)

In [21]:
iris2.head()

   petal_len  petal_wid
0        1.4        0.2
1        1.4        0.2
2        1.3        0.2
3        1.5        0.2
4        1.4        0.2

In [22]:
iris.head()

   sepal_len  sepal_wid  petal_len  petal_wid
0        5.1        3.5        1.4        0.2
1        4.9        3.0        1.4        0.2
2        4.7        3.2        1.3        0.2
3        4.6        3.1        1.5        0.2
4        5.0        3.6        1.4        0.2

In [23]:
iris3 = iris.drop([0, 1, 4, 8])

In [24]:
iris3.head(10)

    sepal_len  sepal_wid  petal_len  petal_wid
2         4.7        3.2        1.3        0.2
3         4.6        3.1        1.5        0.2
5         5.4        3.9        1.7        0.4
6         4.6        3.4        1.4        0.3
7         5.0        3.4        1.5        0.2
9         4.9        3.1        1.5        0.1
10        5.4        3.7        1.5        0.2
11        4.8        3.4        1.6        0.2
12        4.8        3.0        1.4        0.1
13        4.3        3.0        1.1        0.1

## Eliminiamo duplicati da una colonna

In [25]:
sepal_wid_unique = iris['sepal_wid'].drop_duplicates()

In [26]:
sepal_wid_unique.head(10)

0     3.5
1     3.0
2     3.2
3     3.1
4     3.6
5     3.9
6     3.4
8     2.9
10    3.7
14    4.0
Name: sepal_wid, dtype: float64

In [27]:
iris.head(10)

   sepal_len  sepal_wid  petal_len  petal_wid
0        5.1        3.5        1.4        0.2
1        4.9        3.0        1.4        0.2
2        4.7        3.2        1.3        0.2
3        4.6        3.1        1.5        0.2
4        5.0        3.6        1.4        0.2
5        5.4        3.9        1.7        0.4
6        4.6        3.4        1.4        0.3
7        5.0        3.4        1.5        0.2
8        4.4        2.9        1.4        0.2
9        4.9        3.1        1.5        0.1

## Gestione dei valori sconosciuti 

Andiamo a vedere due modi per eliminare o manipolari valori sconosciuti e non riconosciuti durante l'importazione'

### Eliminiamo tutte le righe con valori sconosciuti

In [28]:
from numpy import nan

In [29]:
type(nan)

float

In [30]:
nan_df = pd.DataFrame([[1, 3, nan, 4], 
                   [nan, 9, 10, nan], 
                   [5,6,5,6,]], 
                   columns = ['come', 'quando', 'fuori', 'piove'])

In [31]:
nan_df

   come  quando  fuori  piove
0   1.0       3    NaN    4.0
1   NaN       9   10.0    NaN
2   5.0       6    5.0    6.0

In [32]:
no_nan = nan_df.dropna()

In [33]:
no_nan

   come  quando  fuori  piove
2   5.0       6    5.0    6.0

### Convertiamo i valori sconosciuti in zeri

In [34]:
zero_nan = nan_df.fillna(0)

In [35]:
zero_nan

   come  quando  fuori  piove
0   1.0       3    0.0    4.0
1   0.0       9   10.0    0.0
2   5.0       6    5.0    6.0

## Raggruppiamo valori in funzione di una colonna e un operazione

Andiamo a riprenderci il dataset dell'esercitazione per fare alcuni esempi sulla potenza di `.groupby()`.  
L'operazione matematica a seguito raggruppamento `.groupby()` con sarà applicata su tutte le altre colonne numeriche.

In [36]:
survey = pd.read_csv('data/WA_American-Time-Use-Survey-lite.csv')

In [37]:
survey.head()

,Education Level,Age,Age Range,Employment Status,Gender,Children,Weekly Earnings,Year,Weekly Hours Worked,Sleeping,...,Caring for Children,Playing with Children,Job Searching,Shopping,Eating and Drinking,Socializing & Relaxing,Television,Golfing,Running,Volunteering
0,High School,51,50-59,Unemployed,Female,0,0,2005,0,825,...,0,0,0,0,40,180,120,0,0,0
1,Bachelor,42,40-49,Employed,Female,2,1480,2005,40,500,...,365,20,0,120,40,15,15,0,0,0
2,Master,47,40-49,Employed,Male,0,904,2005,40,480,...,0,0,0,15,85,214,199,0,0,0
3,Some College,21,20-29,Employed,Female,0,320,2005,40,705,...,0,0,0,105,30,240,240,0,0,0
4,High School,49,40-49,Not in labor force,Female,0,0,2005,0,470,...,0,0,0,0,35,600,40,0,0,0

In [38]:
survey.shape

(97275, 23)

In [39]:
survey['Age'].min(), survey['Age'].max()

(15, 85)

In [40]:
survey.groupby('Age')

In [41]:
age_mean = survey.groupby('Age').min()

In [42]:
age_mean.head()

,Education Level,Age Range,Employment Status,Gender,Children,Weekly Earnings,Year,Weekly Hours Worked,Sleeping,Grooming,...,Caring for Children,Playing with Children,Job Searching,Shopping,Eating and Drinking,Socializing & Relaxing,Television,Golfing,Running,Volunteering
Age,,,,,,,,,,,,,,,,,,,,,
15,10th grade,0-19,Employed,Female,1,0,2005,0,120,0,...,0,0,0,0,0,0,0,0,0,0
16,10th grade,0-19,Employed,Female,1,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
17,10th grade,0-19,Employed,Female,1,0,2005,0,60,0,...,0,0,0,0,0,0,0,0,0,0
18,10th grade,0-19,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
19,10th grade,0-19,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [43]:
age_twenties = age_mean.loc[20:29, :] # Ricordiamo che .loc prende i nomi, quindi anche 29 sarà compreso!

In [44]:
age_twenties

,Education Level,Age Range,Employment Status,Gender,Children,Weekly Earnings,Year,Weekly Hours Worked,Sleeping,Grooming,...,Caring for Children,Playing with Children,Job Searching,Shopping,Eating and Drinking,Socializing & Relaxing,Television,Golfing,Running,Volunteering
Age,,,,,,,,,,,,,,,,,,,,,
20,10th grade,20-29,Employed,Female,0,0,2005,0,30,0,...,0,0,0,0,0,0,0,0,0,0
21,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
22,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
23,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
24,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
25,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
26,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
27,10th grade,20-29,Employed,Female,0,0,2005,0,120,0,...,0,0,0,0,0,0,0,0,0,0
28,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0
29,10th grade,20-29,Employed,Female,0,0,2005,0,0,0,...,0,0,0,0,0,0,0,0,0,0

## Let's play!
Appliachiamo quanto visto sul dataframe iris e dell'esercitazione